In [2]:
import pandas as pd

In [3]:
s = pd.Series([1,2,3,4,5,6,7])
print(s)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [6]:
index_name = ['M','T','W','Th','F','Sa','Su']
data = [1,2,3,4,5,6,7]
s = pd.Series(data,index_name)

In [7]:
s

M     1
T     2
W     3
Th    4
F     5
Sa    6
Su    7
dtype: int64

In [8]:
df = pd.DataFrame({'first':s,'second':s*2})
df

    first  second
M       1       2
T       2       4
W       3       6
Th      4       8
F       5      10
Sa      6      12
Su      7      14

In [9]:
c_name = ['city','population']
index_country = ['India','Japan', 'China']

In [10]:
row1 = ['Delhi',22.5]
row2 = ['Tokyo',19]
row3 = ['Shanghai',24]

In [11]:
data = [row1,row2,row3]

In [12]:
data

[['Delhi', 22.5], ['Tokyo', 19], ['Shanghai', 24]]

In [13]:
df = pd.DataFrame(data,index= index_country, columns = c_name)

In [14]:
df

           city  population
India     Delhi        22.5
Japan     Tokyo        19.0
China  Shanghai        24.0

In [15]:
cities = ['Delhi','Tokyo','Shanghai']
population = [22.5,19,24]

In [16]:
dict_popu  = {'city':cities,'population':population}

In [17]:
df = pd.DataFrame(dict_popu, index = index_country)

In [18]:
df

           city  population
India     Delhi        22.5
Japan     Tokyo        19.0
China  Shanghai        24.0